benchmark/old_outputs/single_thread/sieve_new/uni_4/2026-04-17T19:41:05-04:00_9_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 2954262
number of failed transactions: 0 (0.000%)
latency average = 0.122 ms
initial connection time = 2.676 ms
tps = 16412.800640 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 9 (targets 90.0% of total)
 - 2659155 transactions (90.0% of total)
 - number of transactions actually processed: 2659155 (tps = 14773.293935)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.088 ms
 - latency stddev = 0.037 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 10.0% of total)
 - 295107 transactions (10.0% of total)
 - number of transactions actually processed: 295107 (tps = 1639.506705)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.421 ms
 - latency stddev = 0.451 ms
ratio: .283100277577945